jason3w/pyflash-web/Puya.PY32F0xx_DFP.1.2.8/Drivers/CMSIS/Device/PY32F0xx/Include/py32f002zx4.h
/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos                  (0U)
#define IWDG_PR_PR_Msk                  (0x7UL << IWDG_PR_PR_Pos)          /*!< 0x00000007 */
#define IWDG_PR_PR                      IWDG_PR_PR_Msk                     /*!<PR[2:0] (Prescaler divider) */
#define IWDG_PR_PR_0                    (0x1UL << IWDG_PR_PR_Pos)          /*!< 0x00000001 */
#define IWDG_PR_PR_1                    (0x2UL << IWDG_PR_PR_Pos)          /*!< 0x00000002 */
#define IWDG_PR_PR_2                    (0x4UL << IWDG_PR_PR_Pos)          /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos                 (0U)
#define IWDG_RLR_RL_Msk                 (0xFFFUL << IWDG_RLR_RL_Pos)       /*!< 0x00000FFF */
#define IWDG_RLR_RL                     IWDG_RLR_RL_Msk                    /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos                 (0U)
#define IWDG_SR_PVU_Msk                 (0x1UL << IWDG_SR_PVU_Pos)         /*!< 0x00000001 */
#define IWDG_SR_PVU                     IWDG_SR_PVU_Msk                    /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos                 (1U)
#define IWDG_SR_RVU_Msk                 (0x1UL << IWDG_SR_RVU_Pos)         /*!< 0x00000002 */
#define IWDG_SR_RVU                     IWDG_SR_RVU_Msk                    /*!< Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                        Power Control (PWR)                                 */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_BIAS_CR_Pos             (0U)
#define PWR_CR1_BIAS_CR_Msk             (0xFUL << PWR_CR1_BIAS_CR_Pos)     /*!< 0x0000000F */
#define PWR_CR1_BIAS_CR                 PWR_CR1_BIAS_CR_Msk                /*!< Low Power Mode Selection */
#define PWR_CR1_BIAS_CR_0               (0x1UL << PWR_CR1_BIAS_CR_Pos)     /*!< 0x00000001 */
#define PWR_CR1_BIAS_CR_1               (0x2UL << PWR_CR1_BIAS_CR_Pos)     /*!< 0x00000002 */
#define PWR_CR1_BIAS_CR_2               (0x4UL << PWR_CR1_BIAS_CR_Pos)     /*!< 0x00000004 */
#define PWR_CR1_BIAS_CR_3               (0x8UL << PWR_CR1_BIAS_CR_Pos)     /*!< 0x00000008 */

#define PWR_CR1_BIAS_CR_SEL_Pos         (4U)
#define PWR_CR1_BIAS_CR_SEL_Msk         (0x1UL << PWR_CR1_BIAS_CR_SEL_Pos)
#define PWR_CR1_BIAS_CR_SEL             PWR_CR1_BIAS_CR_SEL_Msk

#define PWR_CR1_FLS_SLPTIME_Pos         (12U)
#define PWR_CR1_FLS_SLPTIME_Msk         (0x3UL << PWR_CR1_FLS_SLPTIME_Pos) /*!< 0x00003000 */
#define PWR_CR1_FLS_SLPTIME             PWR_CR1_FLS_SLPTIME_Msk
#define PWR_CR1_FLS_SLPTIME_0           (0x1UL << PWR_CR1_FLS_SLPTIME_Pos)
#define PWR_CR1_FLS_SLPTIME_1           (0x2UL << PWR_CR1_FLS_SLPTIME_Pos)

#define PWR_CR1_LPR_Pos                 (14U)
#define PWR_CR1_LPR_Msk                 (0x3UL << PWR_CR1_LPR_Pos)         /*!< 0x0000C000 */
#define PWR_CR1_LPR                     PWR_CR1_LPR_Msk                    /*!< Regulator Low-Power Run mode */
#define PWR_CR1_LPR_0                   (0x1UL << PWR_CR1_LPR_Pos)
#define PWR_CR1_LPR_1                   (0x2UL << PWR_CR1_LPR_Pos)

#define PWR_CR1_SRAM_RETV_Pos           (17U)
#define PWR_CR1_SRAM_RETV_Msk           (0x1UL << PWR_CR1_SRAM_RETV_Pos)   /*!< 0x00020000 */
#define PWR_CR1_SRAM_RETV               PWR_CR1_SRAM_RETV_Msk              /*!< SRAM retention voltage control in Stop mode */
#define PWR_CR1_SRAM_RETV_DLP_Pos       (18U)
#define PWR_CR1_SRAM_RETV_DLP_Msk       (0x1UL << PWR_CR1_SRAM_RETV_DLP_Pos) /*!< 0x00040000 */
#define PWR_CR1_SRAM_RETV_DLP           PWR_CR1_SRAM_RETV_DLP_Msk            /*!< SRAM retention voltage control in DeepStop mode */
#define PWR_CR1_HSION_CTRL_Pos          (19U)
#define PWR_CR1_HSION_CTRL_Msk          (0x1UL << PWR_CR1_HSION_CTRL_Pos)  /*!< 0x00080000 */
#define PWR_CR1_HSION_CTRL              PWR_CR1_HSION_CTRL_Msk             /*!< HSI enables time control when waking from stop mode */

/******************************************************************************/
/*                                                                            */
/*                           Reset and Clock Control (RCC)                    */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions
*/
#define RCC_LSE_SUPPORT
#define RCC_HSI48M_SUPPORT              /*!< HSI 48MHz feature is only available in the specified (V1.1.9) version and above */

/********************  Bit definition for RCC_CR register  *****************/
#define RCC_CR_HSION_Pos                (8U)
#define RCC_CR_HSION_Msk                (0x1UL << RCC_CR_HSION_Pos)            /*!< 0x00000100 */
#define RCC_CR_HSION                    RCC_CR_HSION_Msk                       /*!< Internal High Speed clock enable */
#define RCC_CR_HSIRDY_Pos               (10U)
#define RCC_CR_HSIRDY_Msk               (0x1UL << RCC_CR_HSIRDY_Pos)           /*!< 0x00000400 */
#define RCC_CR_HSIRDY                   RCC_CR_HSIRDY_Msk                      /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_Pos               (11U)
#define RCC_CR_HSIDIV_Msk               (0x7UL << RCC_CR_HSIDIV_Pos)           /*!< 0x00003800 */
#define RCC_CR_HSIDIV                   RCC_CR_HSIDIV_Msk                      /*!< HSIDIV[13:11] Internal High Speed clock division factor */
#define RCC_CR_HSIDIV_0                 (0x1UL << RCC_CR_HSIDIV_Pos)           /*!< 0x00000800 */
#define RCC_CR_HSIDIV_1                 (0x2UL << RCC_CR_HSIDIV_Pos)           /*!< 0x00001000 */
#define RCC_CR_HSIDIV_2                 (0x4UL << RCC_CR_HSIDIV_Pos)           /*!< 0x00002000 */
#define RCC_CR_HSEEN_Pos                (18U)
#define RCC_CR_HSEEN_Msk                (0x1UL << RCC_CR_HSEEN_Pos)            /*!< 0x00040000 */
#define RCC_CR_HSEEN                    RCC_CR_HSEEN_Msk                       /*!< External High Speed clock enable */

/********************  Bit definition for RCC_ICSCR register  ***************/
#define RCC_ICSCR_HSI_TRIM_Pos          (0U)
#define RCC_ICSCR_HSI_TRIM_Msk          (0x1FFFUL << RCC_ICSCR_HSI_TRIM_Pos)   /*!< 0x00001FFF */
#define RCC_ICSCR_HSI_TRIM              RCC_ICSCR_HSI_TRIM_Msk                 /*!< HSITRIM[12:0] bits */
#define RCC_ICSCR_HSI_TRIM_0            (0x01UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000001 */
#define RCC_ICSCR_HSI_TRIM_1            (0x02UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000002 */
#define RCC_ICSCR_HSI_TRIM_2            (0x04UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000004 */
#define RCC_ICSCR_HSI_TRIM_3            (0x08UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000008 */
#define RCC_ICSCR_HSI_TRIM_4            (0x10UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000010 */
#define RCC_ICSCR_HSI_TRIM_5            (0x20UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000020 */
#define RCC_ICSCR_HSI_TRIM_6            (0x40UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000040 */
#define RCC_ICSCR_HSI_TRIM_7            (0x80UL << RCC_ICSCR_HSI_TRIM_Pos)     /*!< 0x00000080 */
#define RCC_ICSCR_HSI_TRIM_8            (0x100UL << RCC_ICSCR_HSI_TRIM_Pos)    /*!< 0x00000100 */
#define RCC_ICSCR_HSI_TRIM_9            (0x200UL << RCC_ICSCR_HSI_TRIM_Pos)    /*!< 0x00000200 */
#define RCC_ICSCR_HSI_TRIM_10           (0x400UL << RCC_ICSCR_HSI_TRIM_Pos)    /*!< 0x00000400 */
#define RCC_ICSCR_HSI_TRIM_11           (0x800UL << RCC_ICSCR_HSI_TRIM_Pos)    /*!< 0x00000800 */
#define RCC_ICSCR_HSI_TRIM_12           (0x1000UL << RCC_ICSCR_HSI_TRIM_Pos)   /*!< 0x00001000 */
#define RCC_ICSCR_HSI_FS_Pos            (13U)
#define RCC_ICSCR_HSI_FS_Msk            (0x7UL << RCC_ICSCR_HSI_FS_Pos)        /*!< 0x0000E000 */
#define RCC_ICSCR_HSI_FS                RCC_ICSCR_HSI_FS_Msk                   /*!< HSIFS[15:13] bits */
#define RCC_ICSCR_HSI_FS_0              (0x01UL << RCC_ICSCR_HSI_FS_Pos)       /*!< 0x00002000 */
#define RCC_ICSCR_HSI_FS_1              (0x02UL << RCC_ICSCR_HSI_FS_Pos)       /*!< 0x00004000 */
#define RCC_ICSCR_HSI_FS_2              (0x04UL << RCC_ICSCR_HSI_FS_Pos)       /*!< 0x00008000 */
#define RCC_ICSCR_LSI_TRIM_Pos          (16U)
#define RCC_ICSCR_LSI_TRIM_Msk          (0x1FFUL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM              RCC_ICSCR_LSI_TRIM_Msk
#define RCC_ICSCR_LSI_TRIM_0            (0x01UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_1            (0x02UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_2            (0x04UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_3            (0x08UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_4            (0x10UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_5            (0x20UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_6            (0x40UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_7            (0x80UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_8            (0x100UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_STARTUP_Pos       (26U)
#define RCC_ICSCR_LSI_STARTUP_Msk       (0x3UL << RCC_ICSCR_LSI_STARTUP_Pos)
#define RCC_ICSCR_LSI_STARTUP           RCC_ICSCR_LSI_STARTUP_Msk
#define RCC_ICSCR_LSI_STARTUP_0         (0x01UL << RCC_ICSCR_LSI_STARTUP_Pos)
#define RCC_ICSCR_LSI_STARTUP_1         (0x02UL << RCC_ICSCR_LSI_STARTUP_Pos)

/********************  Bit definition for RCC_CFGR register  ***************/
/*!< SW configuration */
#define RCC_CFGR_SW_Pos                 (0U)
#define RCC_CFGR_SW_Msk                 (0x7UL << RCC_CFGR_SW_Pos)             /*!< 0x00000007 */
#define RCC_CFGR_SW                     RCC_CFGR_SW_Msk                        /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                   (0x1UL << RCC_CFGR_SW_Pos)             /*!< 0x00000001 */
#define RCC_CFGR_SW_1                   (0x2UL << RCC_CFGR_SW_Pos)             /*!< 0x00000002 */
#define RCC_CFGR_SW_2                   (0x4UL << RCC_CFGR_SW_Pos)             /*!< 0x00000004 */

